app/Controllers/DbTransTblHgeController.php

SELECT *
FROM `dbreference_ref_region`
WHERE `RegCode` = '05'
 LIMIT 1
---
    public function index()
    {
        $refRegion = new DbreferenceRefRegionModel();
        $data['refRegion'] = $refRegion->where('RegCode', '05')->first();

SELECT *
FROM `dbreference_ref_higher_educ_inst`
WHERE `geoRegCode` = '05'
---
    public function check_hge()
    {
        $refHigherEducInst = new DbrefereneRefHigherEducInstModel();
        $data['refHigherEducInst'] = $refHigherEducInst->where('geoRegCode', '05')->findAll();