app/Controllers/MSProofingController.php

    public function insertProofing()
    {

        $insertProofing = new \App\Models\MSProofingModel();
        $data = [
            'TransRecordID' => $this->request->getPost('TransRecordID'),
            'ProofingPrintingDate' => $this->request->getPost('ProofingPrintingDate'),
            'UserCode' => $this->request->getPost('UserCode'),
            'ApproverCode' => $this->request->getPost('ApproverCode')
        ];


        if ($insertProofing->insert($data)) {
---
INSERT INTO `ms_proofing` (`TransRecordID`, `ProofingPrintingDate`, `UserCode`, `ApproverCode`) VALUES ('123456', '2022-07-20', 'jcm', 'slp')