app/Controllers/TblToRenameController.php

    public function index()
    {
        $displayForRename = new TblToRenameModel();
        $data['displayForRename'] = $displayForRename->findAll();
---
SELECT *
FROM `tbl_to_rename`